tap "aquasecurity/trivy"
tap "dkanejs/aws-session-manager-plugin"
tap "ferdium/ferdium"
tap "go-delve/delve"
tap "golangci/tap"
tap "goreleaser/tap"
tap "guumaster/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "kishaningithub/tap"
tap "mike-engel/jwt-cli"
tap "rs/tap"
tap "saulpw/vd"
tap "sonatype-nexus-community/nancy-tap"
tap "trufflesecurity/trufflehog"
tap "turbot/tap"
tap "tylerbrock/saw"
# Portable ASCII art graphics library
brew "aalib"
# Simple, modern, secure file encryption
brew "age"
# GNU database manager
brew "gdbm"
# YAML Parser
brew "libyaml"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Image format providing lossless and lossy compression for web images
brew "webp"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Download with resuming and segmented downloading
brew "aria2"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Generic library support script
brew "libtool"
# ODBC 3 connectivity for UNIX
brew "unixodbc"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Core application library for C
brew "glib"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# GNOME accessibility toolkit
brew "atk"
# Shell extension to jump to frequently used directories
brew "autojump"
# XML-based font configuration API for X Windows
brew "fontconfig"
# Manage compile and link flags for libraries
brew "pkg-config"
# X.Org: Core X11 protocol client library
brew "libx11"
# Vector graphics library with cross-device output support
brew "cairo"
# OpenType text shaping engine
brew "harfbuzz"
# Avro command-line tools and utilities
brew "avro-tools"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Garbage collector for C and C++
brew "bdw-gc"
# Remove large files or passwords from Git history like git-filter-branch
brew "bfg"
# Interface bandwidth monitor
brew "bmon"
# Pipe HTML to a browser
brew "browser"
# GNU compiler collection
brew "gcc"
# Rich and complete approach to parallelism in C++
brew "tbb"
# C++ library for large-scale optimization
brew "ceres-solver"
# Validate CloudFormation templates against the CloudFormation spec
brew "cfn-lint"
# Generate code for scanning Z-polyhedra
brew "cloog"
# CloudFormation Provider Development Toolkit
brew "cloudformation-cli"
# Cross-platform make
brew "cmake"
# Console Matrix
brew "cmatrix"
# ISO AAC audio decoder
brew "faad2"
# Free lossless audio codec
brew "flac"
# International domain name library (IDNA2008, Punycode and TR46)
brew "libidn2"
# Validating, recursive, caching DNS resolver
brew "unbound", restart_service: true
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Vorbis General Audio Compression Codec
brew "libvorbis"
# Secure Reliable Transport
brew "srt"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Cue sheet parser library for C
brew "libcue"
# Music player with an ncurses based interface
brew "cmus"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# Configurable talking characters in ASCII art
brew "cowsay"
# Validate and define text-based and dynamic configuration
brew "cue"
# Load/unload environment variables based on $PWD
brew "direnv"
# Tool for exploring each layer in a docker image
brew "dive"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Isolated development environments using Docker
brew "docker-compose"
# Text mode web browser
brew "elinks"
# Simple, fast and user-friendly alternative to find
brew "fd"
# C routines to compute the Discrete Fourier Transform
brew "fftw"
# Collection of reusable C++ library artifacts developed at Facebook
brew "folly"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Command-line fuzzy finder written in Go
brew "fzf"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# GSettings schemas for desktop components
brew "gsettings-desktop-schemas"
# Network related modules for glib
brew "glib-networking"
# Render markdown on the CLI
brew "glow"
# Full-Featured Open-Source Framework for Image Processing
brew "gmic"
# Common error values for all GnuPG components
brew "libgpg-error"
# Cryptographic library based on the code from GnuPG
brew "libgcrypt"
# X.509 and CMS library
brew "libksba"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Log analyzer and interactive viewer for the Apache Webserver
brew "goaccess"
# Fast linters runner for Go
brew "golangci-lint"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Image processing tools collection
brew "graphicsmagick"
# Framework for layout and rendering of i18n text
brew "pango"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Kubernetes package manager
brew "helm"
# Command-line hex viewer
brew "hexyl"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Curl statistics made simple
brew "httpstat"
# Website copier/offline browser
brew "httrack"
# Configurable static site generator
brew "hugo"
# Command-line benchmarking tool
brew "hyperfine"
# Tool for managing apps on iOS devices
brew "ideviceinstaller"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Install and debug iPhone apps from the command-line
brew "ios-deploy"
# Peer-to-peer hypermedia protocol
brew "ipfs"
# CLI wrapper for basic network utilities on macOS - ip command
brew "iproute2mac"
# Implementation of malloc emphasizing fragmentation avoidance
brew "jemalloc"
# Manage your Java environment
brew "jenv"
# Json incremental digger
brew "jid"
# Load testing and performance measurement application
brew "jmeter"
# Regular expressions library
brew "oniguruma"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Modern load testing tool, using Go and JavaScript
brew "k6"
# Generic command-line non-JVM Apache Kafka producer and consumer
brew "kcat"
# Network authentication protocol
brew "krb5"
# Simple terminal UI for git commands
brew "lazygit"
# Postgres C API library
brew "libpq"
# Library for complex text layout
brew "libraqm"
# HTTP client/server library for GNOME
brew "libsoup"
# Multi-platform support library with a focus on asynchronous I/O
brew "libuv"
# GNOME XML library
brew "libxml2"
# C XSLT library for GNOME
brew "libxslt"
# LZMA-based compression program similar to gzip or bzip2
brew "lzip"
# Make/rake-like build tool using Go
brew "mage"
# Platform built on V8 to build network applications
brew "node"
# Easily convert Marp Markdown files into static HTML/CSS, PDF, PPT and images
brew "marp-cli"
# Java-based project management
brew "maven"
# Fast and user friendly build system
brew "meson"
# Modern and intuitive terminal-based text editor
brew "micro"
# Terminal-based visual file manager
brew "midnight-commander"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Move, copy, append, and link multiple files
brew "mmv"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# Library for a binary-based efficient data interchange format
brew "msgpack"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Text interface for Git repositories
brew "tig"
# Pager/text based browser
brew "w3m"
# Command-line and local web note‑taking, bookmarking, and archiving
brew "nb"
# NCurses Disk Usage
brew "ncdu"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# HTTP/2 C Library
brew "nghttp2"
# Tiny, lightning fast, feature-packed file manager
brew "nnn"
# Libraries for security-enabled client and server applications
brew "nss"
# Package for scientific computing with Python
brew "numpy"
# Manage multiple Node.js versions
brew "nvm"
# Seamless operability between C++11 and Python
brew "pybind11"
# Adds an OCR text layer to scanned PDF files
brew "ocrmypdf"
# Development kit for the Java programming language
brew "openjdk@11"
# Apache Parquet command-line tools and utilities
brew "parquet-cli"
# Apache Parquet command-line tools and utilities
brew "parquet-tools"
# CLI for Postgres with auto-completion and syntax highlighting
brew "pgcli"
# Colored logcat script to show entries only for specified app
brew "pidcat"
# Python dependency management tool
brew "pipenv"
# Python package management tool
brew "poetry"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Highly configurable GPL-licensed FTP server software
brew "proftpd", restart_service: true
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Show ps output as a tree
brew "pstree"
# Monitor data's progress through a pipe
brew "pv"
# Sampling profiler for Python programs
brew "py-spy"
# Python version management
brew "pyenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Generate types and converters from JSON, Schema, and GraphQL
brew "quicktype"
# Rsync for cloud storage
brew "rclone"
# Standard unix software packaging tool
brew "rpm"
# Build tool for Scala projects
brew "sbt"
# JVM-based programming language
brew "scala"
# Easily detect and prevent bugs and anti-patterns in your codebase
brew "semgrep"
# Tool to create Python bindings for C and C++ libraries
brew "sip"
# Prints a steam locomotive if you type sl instead of ls
brew "sl"
# Tool to create intelligent and beautiful documentation
brew "sphinx-doc"
# Displays the differences between SQLite databases
brew "sqldiff"
# User interface to the TELNET protocol
brew "telnet"
# Tool to build, change, and version infrastructure
brew "terraform"
# Terraform State → Ansible Dynamic Inventory
brew "terraform-inventory"
# Enables extra languages support for Tesseract
brew "tesseract-lang"
# Executes SQL across text files
brew "textql"
# Code-search similar to ack
brew "the_silver_searcher"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Generic Python virtualenv management and test command-line tool
brew "tox"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Realtime plotting utility for terminal with data input from stdin
brew "ttyplot"
# CLI time zone visualizer
brew "tz"
# Compiler for the GObject type system
brew "vala"
# HTTP load testing tool and library
brew "vegeta"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Command-line tool to track (your) time
brew "watson"
# Internet file retriever
brew "wget"
# Personal information dashboard for your terminal
brew "wtfutil"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# General-purpose lossless data-compression library
brew "zlib"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Official Amazon AWS session manager plugin
brew "dkanejs/aws-session-manager-plugin/aws-session-manager-plugin"
# Deliver Go binaries as fast and easily as possible
brew "goreleaser/tap/goreleaser"
# Your dev tool to manage /etc/hosts like a pro
brew "guumaster/tap/hostctl"
# A no sweat backup and restore tool for dynamodb
brew "kishaningithub/tap/dynamodb-backup-restore"
# Clone your dynamodb
brew "kishaningithub/tap/dynamodb-clone"
# Tail kafka avro topic data without confluent schema registry overhead
brew "kishaningithub/tap/kafka-console-avro-without-schema-registry"
# Get performance metrics based on kafka events
brew "kishaningithub/tap/kafka-perf"
# Eats memory at a specified constant rate
brew "kishaningithub/tap/memory-eater"
# Command line random text generator
brew "kishaningithub/tap/randomtext"
# rdapp - redshift data api postgres proxy
brew "kishaningithub/tap/rdapp"
# Download a shopify site in a csv format that the shopify importer understands
brew "kishaningithub/tap/shopify-csv-download"
# Super fast CLI tool to decode and encode JWTs built in Rust
brew "mike-engel/jwt-cli/jwt-cli"
# Find credentials all over the place
brew "trufflesecurity/trufflehog/trufflehog"
# Steampipe exposes APIs and services as a high-performance relational database, giving you the ability to write SQL-based queries to explore, assess and report on dynamic data.
brew "turbot/tap/steampipe"
# Fast, multipurpose tool for AWS CloudWatch Logs
brew "tylerbrock/saw/saw"
# View, print, and comment on PDF documents
cask "adobe-acrobat-reader"
# Managed desktop virtualization solution
cask "citrix-workspace"
# Draw.io is free online diagram software
cask "drawio"
# Client for the Dropbox cloud storage service
cask "dropbox"
# App for note taking, organizing, task lists, and archiving
cask "evernote"
# Multi-platform multi-messaging app
cask "ferdium"
# Web browser
cask "firefox"
# Screen color temperature controller
cask "flux"
# Clipboard manager for developers
cask "flycut"
# Free and open-source image editor
cask "gimp"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# Open-source video transcoder
cask "handbrake"
# Tool to optimize images to a smaller size
cask "imageoptim"
# Vector graphics editor
cask "inkscape"
# Java IDE by JetBrains
cask "intellij-idea"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Standalone Java Decompiler GUI
cask "jd-gui"
# Note taking and to-do application with synchronization capabilities
cask "joplin"
# Password manager app
cask "keepassxc"
# Office suite
cask "libreoffice"
# Animated screen capture application
cask "licecap"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Web browser
cask "opera"
# App wrapper for Postgres
cask "postgres-unofficial"
# IDE for professional Python development
cask "pycharm"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Authentication software
cask "securid"
# Team communication and collaboration software
cask "slack"
# System monitor for the menu bar
cask "stats"
# Customizable email client
cask "thunderbird"
# Web browser focusing on security
cask "tor-browser"
# Open-source BitTorrent client
cask "transmission"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Binary releases of VS Code without MS branding/telemetry/licensing
cask "vscodium"
# View output from scripts in the menu bar
cask "xbar"
# Open-source version of the X.Org X Window System
cask "xquartz"
# Video communication and virtual meeting platform
cask "zoom"
