tap "aquasecurity/trivy"
tap "aws/tap"
tap "dkanejs/aws-session-manager-plugin"
tap "ferdium/ferdium"
tap "go-delve/delve"
tap "golangci/tap"
tap "goreleaser/tap"
tap "guumaster/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "kishaningithub/tap"
tap "lindell/multi-gitter"
tap "mike-engel/jwt-cli"
tap "pkgxdev/made"
tap "rs/tap"
tap "saulpw/vd"
tap "sonatype-nexus-community/nancy-tap"
tap "thecasualcoder/stable"
tap "trufflesecurity/trufflehog"
tap "turbot/tap"
tap "tylerbrock/saw"
tap "zmwangx/npm-noob"
# Portable ASCII art graphics library
brew "aalib"
# Run your GitHub Actions locally
brew "act"
# Static checker for GitHub Actions workflow files
brew "actionlint"
# Simple, modern, secure file encryption
brew "age"
# Image format providing lossless and lossy compression for web images
brew "webp"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Download with resuming and segmented downloading
brew "aria2"
# Portable library for importing many well-known 3D model formats
brew "assimp"
# GNU database manager
brew "gdbm"
# Core application library for C
brew "glib"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# GNOME accessibility toolkit
brew "atk"
# Automatic configure script builder
brew "autoconf"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Shell extension to jump to frequently used directories
brew "autojump"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# XML-based font configuration API for X Windows
brew "fontconfig"
# X.Org: Core X11 protocol client library
brew "libx11"
# Manage compile and link flags for libraries
brew "pkg-config"
# Vector graphics library with cross-device output support
brew "cairo"
# OpenType text shaping engine
brew "harfbuzz"
# Avro command-line tools and utilities
brew "avro-tools"
# Text processing system for reStructuredText
brew "docutils"
# Official Amazon AWS command-line interface
brew "awscli"
# YAML Parser
brew "libyaml"
# Security-oriented static analyser for Python code
brew "bandit"
# Regular expressions library
brew "oniguruma"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Garbage collector for C and C++
brew "bdw-gc"
# Remove large files or passwords from Git history like git-filter-branch
brew "bfg"
# Interface bandwidth monitor
brew "bmon"
# Pipe HTML to a browser
brew "browser"
# GNU compiler collection
brew "gcc"
# Rich and complete approach to parallelism in C++
brew "tbb"
# C++ library for large-scale optimization
brew "ceres-solver"
# Generate code for scanning Z-polyhedra
brew "cloog"
# Cross-platform make
brew "cmake"
# Console Matrix
brew "cmatrix"
# ISO AAC audio decoder
brew "faad2"
# Free lossless audio codec
brew "flac"
# International domain name library (IDNA2008, Punycode and TR46)
brew "libidn2"
# Validating, recursive, caching DNS resolver
brew "unbound", restart_service: true
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Vorbis General Audio Compression Codec
brew "libvorbis"
# Framework for layout and rendering of i18n text
brew "pango"
# Secure Reliable Transport
brew "srt"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Cue sheet parser library for C
brew "libcue"
# Music player with an ncurses based interface
brew "cmus"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Emulator for x86 and PowerPC
brew "qemu"
# Linux virtual machines
brew "lima"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# Python composable command-line interface toolkit
brew "python-click"
# Utility that creates projects from templates
brew "cookiecutter"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Configurable talking characters in ASCII art
brew "cowsay"
# Validate and define text-based and dynamic configuration
brew "cue"
# Load/unload environment variables based on $PWD
brew "direnv"
# Tool for exploring each layer in a docker image
brew "dive"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Docker CLI plugin for extended build capabilities with BuildKit
brew "docker-buildx"
# Isolated development environments using Docker
brew "docker-compose"
# Text mode web browser
brew "elinks"
# Simple, fast and user-friendly alternative to find
brew "fd"
# C routines to compute the Discrete Fourier Transform
brew "fftw"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Command-line fuzzy finder written in Go
brew "fzf"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# GSettings schemas for desktop components
brew "gsettings-desktop-schemas"
# Network related modules for glib
brew "glib-networking"
# Render markdown on the CLI
brew "glow"
# Full-Featured Open-Source Framework for Image Processing
brew "gmic"
# Common error values for all GnuPG components
brew "libgpg-error"
# Cryptographic library based on the code from GnuPG
brew "libgcrypt"
# X.509 and CMS library
brew "libksba"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Generic library support script
brew "libtool"
# Image processing tools collection
brew "graphicsmagick"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GNU grep, egrep and fgrep
brew "grep"
# Command-line hex viewer
brew "hexyl"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Curl statistics made simple
brew "httpstat"
# Website copier/offline browser
brew "httrack"
# Tool for managing apps on iOS devices
brew "ideviceinstaller"
# Display an interface's bandwidth usage
brew "iftop"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Install and debug iPhone apps from the command-line
brew "ios-deploy"
# CLI wrapper for basic network utilities on macOS - ip command
brew "iproute2mac"
# Serializes the output of command-line tools to structured JSON output
brew "jc"
# Implementation of malloc emphasizing fragmentation avoidance
brew "jemalloc"
# Manage your Java environment
brew "jenv"
# Json incremental digger
brew "jid"
# Load testing and performance measurement application
brew "jmeter"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Generic command-line non-JVM Apache Kafka producer and consumer
brew "kcat"
# Build and deploy Go applications on Kubernetes
brew "ko"
# Network authentication protocol
brew "krb5"
# Simple terminal UI for git commands
brew "lazygit"
# Postgres C API library
brew "libpq"
# Library for complex text layout
brew "libraqm"
# HTTP client/server library for GNOME
brew "libsoup"
# Multi-platform support library with a focus on asynchronous I/O
brew "libuv"
# GNOME XML library
brew "libxml2"
# C XSLT library for GNOME
brew "libxslt"
# Library for database change tracking
brew "liquibase"
# LZMA-based compression program similar to gzip or bzip2
brew "lzip"
# Make/rake-like build tool using Go
brew "mage"
# Catches mail and serves it through a dream
brew "mailcatcher"
# Platform built on V8 to build network applications
brew "node"
# Easily convert Marp Markdown files into static HTML/CSS, PDF, PPT and images
brew "marp-cli"
# Java-based project management
brew "maven"
# Fast and user friendly build system
brew "meson"
# Modern and intuitive terminal-based text editor
brew "micro"
# Terminal-based visual file manager
brew "midnight-commander"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Move, copy, append, and link multiple files
brew "mmv"
# Library for a binary-based efficient data interchange format
brew "msgpack"
# CLI for MySQL with auto-completion and syntax highlighting
brew "mycli"
# General-purpose lossless data-compression library
brew "zlib"
# Open source relational database management system
brew "mysql"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Text interface for Git repositories
brew "tig"
# Pager/text based browser
brew "w3m"
# Command-line and local web note-taking, bookmarking, and archiving
brew "nb"
# NCurses Disk Usage
brew "ncdu"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# HTTP/2 C Library
brew "nghttp2"
# Tiny, lightning fast, feature-packed file manager
brew "nnn"
# Libraries for security-enabled client and server applications
brew "nss"
# Package for scientific computing with Python
brew "numpy", link: false
# Manage multiple Node.js versions
brew "nvm"
# Okta authentication for awscli
brew "okta-awscli"
# Open source, general-purpose policy engine
brew "opa"
# Development kit for the Java programming language
brew "openjdk@11"
# Apache Parquet command-line tools and utilities
brew "parquet-cli"
# Apache Parquet command-line tools and utilities
brew "parquet-tools"
# CLI for Postgres with auto-completion and syntax highlighting
brew "pgcli"
# Colored logcat script to show entries only for specified app
brew "pidcat"
# Object-relational database system
brew "postgresql@15", link: true
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Highly configurable GPL-licensed FTP server software
brew "proftpd", restart_service: true
# Protocol buffers (Google's data interchange format)
brew "protobuf", link: false
# Show ps output as a tree
brew "pstree"
# Monitor data's progress through a pipe
brew "pv"
# Sampling profiler for Python programs
brew "py-spy"
# Seamless operability between C++11 and Python
brew "pybind11"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Generate types and converters from JSON, Schema, and GraphQL
brew "quicktype"
# Rsync for cloud storage
brew "rclone"
# Super S3 command-line tool
brew "s4cmd"
# Build tool for Scala projects
brew "sbt"
# JVM-based programming language
brew "scala"
# Easily detect and prevent bugs and anti-patterns in your codebase
brew "semgrep"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Prints a steam locomotive if you type sl instead of ls
brew "sl"
# Launcher to analyze a project with SonarQube
brew "sonar-scanner"
# Manage code quality
brew "sonarqube"
# Tool to create intelligent and beautiful documentation
brew "sphinx-doc"
# A whitespace formatter for different query languages
brew "sql-formatter"
# Displays the differences between SQLite databases
brew "sqldiff"
# Tool to detect and prevent secrets from getting checked in
brew "talisman"
# User interface to the TELNET protocol
brew "telnet"
# Tool to generate documentation from Terraform modules
brew "terraform-docs"
# Go app which generates a dynamic Ansible inventory from a Terraform state file
brew "terraform-inventory"
# Enables extra languages support for Tesseract
brew "tesseract-lang"
# Executes SQL across text files
brew "textql"
# Linter for Terraform files
brew "tflint"
# Static analysis security scanner for your terraform code
brew "tfsec"
# Code-search similar to ack
brew "the_silver_searcher"
# Programmatically correct mistyped console commands
brew "thefuck"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Generic Python virtualenv management and test command-line tool
brew "tox"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# CLI time zone visualizer
brew "tz"
# ODBC 3 connectivity for UNIX
brew "unixodbc"
# Compiler for the GObject type system
brew "vala"
# HTTP load testing tool and library
brew "vegeta"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Personal information dashboard for your terminal
brew "wtfutil"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Fork of youtube-dl with additional features and fixes
brew "yt-dlp"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# AWS Simple EC2 CLI is a tool that simplifies the process of launching, connecting and terminating an EC2 instance
brew "aws/tap/aws-simple-ec2-cli"
# Official Amazon AWS session manager plugin
brew "dkanejs/aws-session-manager-plugin/aws-session-manager-plugin"
# Deliver Go binaries as fast and easily as possible
brew "goreleaser/tap/goreleaser"
# Your dev tool to manage /etc/hosts like a pro
brew "guumaster/tap/hostctl"
# Packer
brew "hashicorp/tap/packer"
# A no sweat backup and restore tool for dynamodb
brew "kishaningithub/tap/dynamodb-backup-restore"
# Clone your dynamodb
brew "kishaningithub/tap/dynamodb-clone"
# Tail kafka avro topic data without confluent schema registry overhead
brew "kishaningithub/tap/kafka-console-avro-without-schema-registry"
# Get performance metrics based on kafka events
brew "kishaningithub/tap/kafka-perf"
# Eats memory at a specified constant rate
brew "kishaningithub/tap/memory-eater"
# Command line random text generator
brew "kishaningithub/tap/randomtext"
# rdapp - redshift data api postgres proxy
brew "kishaningithub/tap/rdapp"
# Download a shopify site in a csv format that the shopify importer understands
brew "kishaningithub/tap/shopify-csv-download"
# Tool to generate terraform import statements to simplify state migrations from one terraform code base to another
brew "kishaningithub/tap/tf-import-gen"
# Update multiple repositories in bulk
brew "lindell/multi-gitter/multi-gitter"
# Super fast CLI tool to decode and encode JWTs built in Rust
brew "mike-engel/jwt-cli/jwt-cli"
# Run Anything
brew "pkgxdev/made/pkgx"
# A command-line utility to print the summary of the terraform plan
brew "thecasualcoder/stable/tf-summarize"
# Find credentials all over the place
brew "trufflesecurity/trufflehog/trufflehog"
# Fast, multipurpose tool for AWS CloudWatch Logs
brew "tylerbrock/saw/saw"
# Generate Homebrew formulae for npm packages
brew "zmwangx/npm-noob/noob"
# View, print, and comment on PDF documents
cask "adobe-acrobat-reader"
# Tools for building Android applications
cask "android-studio"
# Securely stores and accesses AWS credentials in a development environment
cask "aws-vault"
# Web browser focusing on privacy
cask "brave-browser"
# Managed desktop virtualization solution
cask "citrix-workspace"
# Voice and text chat software
cask "discord"
# Online diagram software
cask "drawio"
# Client for the Dropbox cloud storage service
cask "dropbox"
# App for note taking, organizing, task lists, and archiving
cask "evernote"
# Multi-platform multi-messaging app
cask "ferdium"
# Web browser
cask "firefox"
# UI toolkit for building applications for mobile, web and desktop
cask "flutter"
# Screen color temperature controller
cask "flux"
# Clipboard manager for developers
cask "flycut"
# Free and open-source image editor
cask "gimp"
# Web browser
cask "google-chrome"
# Open-source video transcoder
cask "handbrake"
# Tool to optimize images to a smaller size
cask "imageoptim"
# Java IDE by JetBrains
cask "intellij-idea"
# IDE for Java development - community edition
cask "intellij-idea-ce"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Standalone Java Decompiler GUI
cask "jd-gui"
# Media system
cask "jellyfin"
# Note taking and to-do application with synchronization capabilities
cask "joplin"
# Password manager app
cask "keepassxc"
# Free cross-platform office suite, fresh version
cask "libreoffice"
# Animated screen capture application
cask "licecap"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# App to write, plan, collaborate, and get organized
cask "notion"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Web browser
cask "opera"
# Collaboration platform for API development
cask "postman"
# IDE for professional Python development
cask "pycharm"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Authentication software
cask "securid"
# Instant messaging application focusing on security
cask "signal"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# System monitor for the menu bar
cask "stats"
# Customizable email client
cask "thunderbird"
# Web browser focusing on security
cask "tor-browser"
# Open-source BitTorrent client
cask "transmission"
# Open-source code editor
cask "visual-studio-code"
# Binary releases of VS Code without MS branding/telemetry/licensing
cask "vscodium"
# View output from scripts in the menu bar
cask "xbar"
# Open-source version of the X.Org X Window System
cask "xquartz"
# Video communication and virtual meeting platform
cask "zoom"
# Collect, organize, cite, and share research sources
cask "zotero"
vscode "bradlc.vscode-tailwindcss"
vscode "brody715.vscode-cuelang"
vscode "charliermarsh.ruff"
vscode "Dart-Code.dart-code"
vscode "Dart-Code.flutter"
vscode "DavidAnson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "DotJoshJohnson.xml"
vscode "dpkshrma.insert-iso-timestamp"
vscode "dvirtz.parquet-viewer"
vscode "eamodio.gitlens"
vscode "EditorConfig.EditorConfig"
vscode "esbenp.prettier-vscode"
vscode "golang.go"
vscode "GraphQL.vscode-graphql"
vscode "GraphQL.vscode-graphql-execution"
vscode "GraphQL.vscode-graphql-syntax"
vscode "Gruntfuggly.todo-tree"
vscode "hashicorp.terraform"
vscode "hediet.vscode-drawio"
vscode "johnpapa.vscode-peacock"
vscode "k--kato.intellij-idea-keybindings"
vscode "kj.sqltools-driver-redshift"
vscode "lightbend.vscode-sbt-scala"
vscode "LogInspector.loginspector"
vscode "marclipovsky.string-manipulation"
vscode "marp-team.marp-vscode"
vscode "matangover.mypy"
vscode "matthewpi.caddyfile-support"
vscode "mgmcdermott.vscode-language-babel"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-mssql.data-workspace-vscode"
vscode "ms-mssql.mssql"
vscode "ms-mssql.sql-bindings-vscode"
vscode "ms-mssql.sql-database-projects-vscode"
vscode "ms-python.flake8"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-mysql"
vscode "mtxr.sqltools-driver-pg"
vscode "mtxr.sqltools-driver-sqlite"
vscode "mushan.vscode-paste-image"
vscode "netcorext.uuid-generator"
vscode "OfHumanBondage.react-proptypes-intellisense"
vscode "Orta.vscode-jest"
vscode "pflannery.vscode-versionlens"
vscode "Prisma.prisma"
vscode "quicktype.quicktype"
vscode "redhat.java"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "scala-lang.scala"
vscode "serayuzgur.crates"
vscode "SonarSource.sonarlint-vscode"
vscode "streetsidesoftware.avro"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "tauri-apps.tauri-vscode"
vscode "tfsec.tfsec"
vscode "thamaraiselvam.remove-blank-lines"
vscode "timonwong.shellcheck"
vscode "tsandall.opa"
vscode "usernamehw.errorlens"
vscode "usernamehw.remove-empty-lines"
vscode "vadimcn.vscode-lldb"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "wix.vscode-import-cost"
vscode "yzhang.markdown-all-in-one"
vscode "zokugun.cron-tasks"
vscode "zokugun.sync-settings"
