# file location: ${HOME}/Brewfile

# This file is used along with the `brew bundle` command to ensure that required packages and apps are installed.
# Also can be used to ensure that any package/apps that were installed as experimentation are uninstalled from the system.
# For a more detailed explanation of the philosophy/reasoning behind this file, please see https://openfolder.sh/macos-migrations-with-brewfile

# These are the common shell aliases that I have setup in the `${HOME}/.aliases` file for ease of running/typing (and also don't need to remember all these commands by-heart!). If you are using my `${HOME}/.aliases`, they will already be present for you. If not, you can then set these up in the respective dotfile of your choice
# alias bcg='brew outdated --greedy'  # List all casks that are outdated like a "dry-run" (and which have version marked as 'latest')
# alias bcug='brew upgrade --greedy'  # Upgrades all casks that are outdated (and which have version marked as 'latest')
# alias bupc='brew bundle check || brew bundle --all --cleanup || true; brew bundle cleanup -f || true; brew cleanup --prune=all || true; brew autoremove || true; brew upgrade || true'
# Upgrades and cleans up all regular outdated casks and libs (non-greedy)

# TODO: Need to find cask for:
#   Tinkertool
#   ZoomHider

# set global preferences for all 'brew install' commands
cask_args appdir: '/Applications', fontdir: '/Library/Fonts', adopt: true

# java_present = system('/usr/libexec/java_home --failfast')
is_arm = ::Hardware::CPU.arm?
# is_beta_os = ::OS::Mac::full_version.unsupported_release?

# TODO: Hardcoding of the dotfiles repo folder - since that env var is not available inside this env
setup_login_items_script = "${HOME}/.config/dotfiles/scripts/setup-login-item.sh"

tap 'romkatv/powerlevel10k'

# Moving these casks to tbe beginning since they are required in the beginning (for manual login) for a vanilla OS installation
cask 'font-meslo-lg-nerd-font'
cask 'keybase', postinstall: "\"#{setup_login_items_script}\" -a 'Keybase'"

# formulae pulled in from homebrew to replace system equivalents to fix any security issues since the OS was released
# This list is enhanced from https://macgnu.codewithshin.com/?id=gnu-programs-existing-in-macos-which-are-outdated
brew 'bash'
brew 'curl'
brew 'git'
brew 'grep'
brew 'less'
brew 'make'
brew 'openssl'
brew 'rsync'
brew 'sqlite3'
brew 'vim'
brew 'wget'
brew 'zsh'

# formulae pulled in for base configs (if these are absent, you will get errors and things won't work)
brew 'diff-so-fancy'
brew 'direnv'
brew 'eza'
brew 'git-extras'
brew 'git-tools'
brew 'mise'
brew 'powerlevel10k'

# casks pulled in for base configs (if these are absent, you will get errors and things won't work)
cask 'iterm2'

# While re-imaging the OS or setting up for the first time, install only the bare minimum apps/utilities so that the rest of the backup restoration can proceed faster.
if ENV.has_key?('HOMEBREW_BASE_INSTALL')
  puts "Only performing base installation!"
  return 0
end

# formulae pulled in for advanced configs (these are optional, but still recommended)
tap 'aquasecurity/trivy'
tap 'aws/tap'
tap 'databricks/tap'
tap 'dkanejs/aws-session-manager-plugin'
tap 'go-delve/delve'
tap 'golangci/tap'
tap 'goreleaser/tap'
tap 'guumaster/tap'
tap 'hashicorp/tap'
tap 'kishaningithub/tap'
tap 'lindell/multi-gitter'
tap 'mike-engel/jwt-cli'
tap 'minamijoyo/hcledit'
tap 'minamijoyo/tfupdate'
tap 'oven-sh/bun'
tap 'pkgxdev/made'
tap 'rs/tap'
tap 'saulpw/vd'
tap 'sonatype-nexus-community/nancy-tap'
tap 'syncdk/aws-session-manager-plugin'
tap 'thecasualcoder/stable'
tap 'trufflesecurity/trufflehog'
tap 'turbot/tap'
tap 'tylerbrock/saw'
tap 'up9inc/repo'
tap 'zmwangx/npm-noob'

brew 'aalib'
brew 'abseil'
brew 'actionlint'
brew 'age'
brew 'aria2'
brew 'assimp'
brew 'at-spi2-core'
brew 'autoconf'
brew 'autojump'
brew 'automake'
brew 'avro-tools'
brew 'awscli'
brew 'bat'
brew 'bdw-gc'
brew 'bfg'
brew 'bmon'
brew 'browser'
brew 'btop'
brew 'cairo'
brew 'cloog'
brew 'cmake'
brew 'cmatrix'
brew 'cmus'
brew 'cocoapods'
brew 'coreutils'
brew 'cowsay'
brew 'databricks/tap/databricks'
brew 'deno'
brew 'direnv'
brew 'dive'
brew 'dkanejs/aws-session-manager-plugin/aws-session-manager-plugin'
brew 'docutils'
brew 'elinks'
brew 'faad2'
brew 'fastfetch'
brew 'fd'
brew 'ffmpeg'
brew 'flac'
brew 'fontconfig'
brew 'fortune'
brew 'fzf'
brew 'gcc'
brew 'gdbm'
brew 'gdk-pixbuf'
brew 'gettext'
brew 'gh'
brew 'git-gui'
brew 'git-remote-codecommit'
brew 'glib'
brew 'glib-networking'
brew 'gnupg'
brew 'graphicsmagick'
brew 'graphviz'
brew 'grep'
brew 'gsettings-desktop-schemas'
brew 'gum'
brew 'guumaster/tap/hostctl'
brew 'harfbuzz'
brew 'helm'
brew 'hexyl'
brew 'htop'
brew 'httpie'
brew 'httpstat'
brew 'httrack'
brew 'hugo'
brew 'icu4c@76'
brew 'ideviceinstaller'
brew 'iftop'
brew 'ios-deploy'
brew 'iproute2mac'
brew 'jemalloc'
brew 'jfrog-cli'
brew 'jid'
brew 'jq'
brew 'moreutils'
brew 'kishaningithub/tap/dynadump'
brew 'kishaningithub/tap/memory-eater'
brew 'kishaningithub/tap/randomtext'
brew 'kishaningithub/tap/rdapp'
brew 'kishaningithub/tap/terralens'
brew 'kishaningithub/tap/tf-import-gen'
brew 'krb5'
brew 'lazygit'
brew 'libass'
brew 'libcue'
brew 'libgcrypt'
brew 'libgpg-error'
brew 'libidn2'
brew 'libksba'
brew 'libpq'
brew 'libraqm'
brew 'librsvg'
brew 'libsoup'
brew 'libtool'
brew 'libuv'
brew 'libvorbis'
brew 'libx11'
brew 'libxml2'
brew 'libxslt'
brew 'libyaml'
brew 'lindell/multi-gitter/multi-gitter'
brew 'lzip'
brew 'mage'
brew 'marp-cli'
brew 'micro'
brew 'mike-engel/jwt-cli/jwt-cli'
brew 'minamijoyo/hcledit/hcledit'
brew 'minamijoyo/tfupdate/tfupdate'
brew 'mkcert'
brew 'mycli'
brew 'ncdu'
brew 'prettyping'
brew 'nghttp2'
brew 'nnn'
brew 'nss'
brew 'oha'
brew 'okta-awscli'
brew 'oniguruma'
brew 'openjdk@11'
brew 'oras'
brew 'pandoc'
brew 'pango'
brew 'pgcli'
brew 'pidcat'
brew 'pkgconf'
brew 'pkgxdev/made/pkgx'
brew 'pngquant'
brew 'pre-commit'
brew 'pstree'
brew 'pv'
brew 'py-spy'
brew 'pybind11'
brew 'rclone'
brew 're2'
brew 'ripgrep'
brew 'rye'
brew 'sd'
brew 'shellcheck'
brew 'sl'
brew 'sonar-scanner'
brew 'sqldiff'
brew 'sqlite'
brew 'srgn'
brew 'srt'
brew 'talisman'
brew 'tbb'
brew 'telnet'
brew 'terminal-notifier'
brew 'terraform-docs'
brew 'terraform-inventory'
brew 'tesseract'
brew 'tesseract-lang'
brew 'textql'
brew 'tfsec'
brew 'thecasualcoder/stable/tf-summarize'
brew 'tig'
brew 'timewarrior'
brew 'tldr'
brew 'tmux'
brew 'tree'
brew 'ttyplot'
brew 'turbot/tap/steampipe'
brew 'tylerbrock/saw/saw'
brew 'tz'
brew 'unbound', restart_service: :changed
brew 'unixodbc'
brew 'uv'
brew 'vala'
brew 'w3m'
brew 'watch'
brew 'watchman'
brew 'webp'
brew 'wget'
brew 'wtfutil'
brew 'yq'
brew 'yt-dlp'
brew 'zlib'
brew 'zmwangx/npm-noob/noob'

cask 'aws-vault-binary'
cask 'brave-browser'
cask 'bruno'
cask 'citrix-workspace'
cask 'crossover'
cask 'drawio'
cask 'dropbox'
cask 'evernote'
cask 'flux-app'
cask 'gimp'
cask 'google-chrome'
cask 'grandperspective'
cask 'handbrake-app'
cask 'imageoptim'
cask 'inkscape'
cask 'intellij-idea'
cask 'jd-gui'
cask 'jellyfin'
cask 'joplin'
cask 'jordanbaird-ice', postinstall: "\"#{setup_login_items_script}\" -a 'Ice'" if ::OS::Mac::version >= 14
cask 'keepassxc'
cask 'libreoffice'
cask 'licecap'
cask 'logitech-options'
cask 'microsoft-auto-update'
cask 'microsoft-teams'
cask 'notunes'
cask 'obsidian'
cask 'pycharm'
cask 'sol'
cask 'stats'
cask 'sublime-text'
cask 'the-unarchiver'
cask 'transmission'
cask 'visual-studio-code'
cask 'vlc'
cask 'whatsapp'
cask 'xquartz'
cask 'zed'
cask 'zoom'

# VSCode extensions
# Note: I don't want brew to silently install VS Code (which is what it does currently if the following lines are present but it doesn't find the executable 'code'!)
is_vscode_installed = !`PATH="/opt/homebrew/bin:/usr/local/bin:${PATH}" which code`.chomp.empty?  # explicitly set PATH since the shell being opened doesn't run the login configs
if is_vscode_installed
  vscode 'a-h.templ'
  vscode 'astro-build.astro-vscode'
  vscode 'bradlc.vscode-tailwindcss'
  vscode 'brody715.vscode-cuelang'
  vscode 'charliermarsh.ruff'
  vscode 'dart-code.dart-code'
  vscode 'databricks.databricks'
  vscode 'davidanson.vscode-markdownlint'
  vscode 'dbaeumer.vscode-eslint'
  vscode 'denoland.vscode-deno'
  vscode 'docker.docker'
  vscode 'dotjoshjohnson.xml'
  vscode 'dpkshrma.insert-iso-timestamp'
  vscode 'dvirtz.parquet-viewer'
  vscode 'eamodio.gitlens'
  vscode 'editorconfig.editorconfig'
  vscode 'esbenp.prettier-vscode'
  vscode 'github.copilot-chat'
  vscode 'github.remotehub'
  vscode 'github.vscode-github-actions'
  vscode 'github.vscode-pull-request-github'
  vscode 'golang.go'
  vscode 'gruntfuggly.todo-tree'
  vscode 'hashicorp.terraform'
  vscode 'k--kato.intellij-idea-keybindings'
  vscode 'loginspector.loginspector'
  vscode 'marclipovsky.string-manipulation'
  vscode 'matangover.mypy'
  vscode 'matthewpi.caddyfile-support'
  vscode 'mechatroner.rainbow-csv'
  vscode 'mgmcdermott.vscode-language-babel'
  vscode 'mikestead.dotenv'
  vscode 'ms-azuretools.vscode-containers'
  vscode 'ms-azuretools.vscode-docker'
  vscode 'ms-python.debugpy'
  vscode 'ms-python.isort'
  vscode 'ms-python.python'
  vscode 'ms-python.vscode-pylance'
  vscode 'ms-python.vscode-python-envs'
  vscode 'ms-toolsai.jupyter'
  vscode 'ms-toolsai.jupyter-keymap'
  vscode 'ms-toolsai.jupyter-renderers'
  vscode 'ms-toolsai.vscode-jupyter-cell-tags'
  vscode 'ms-toolsai.vscode-jupyter-slideshow'
  vscode 'ms-vscode-remote.remote-containers'
  vscode 'ms-vscode-remote.remote-ssh'
  vscode 'ms-vscode-remote.remote-ssh-edit'
  vscode 'ms-vscode.makefile-tools'
  vscode 'ms-vscode.powershell'
  vscode 'ms-vscode.remote-explorer'
  vscode 'ms-vscode.remote-repositories'
  vscode 'mtxr.sqltools'
  vscode 'mushan.vscode-paste-image'
  vscode 'netcorext.uuid-generator'
  vscode 'ofhumanbondage.react-proptypes-intellisense'
  vscode 'orta.vscode-jest'
  vscode 'pflannery.vscode-versionlens'
  vscode 'quicktype.quicktype'
  vscode 'redhat.java'
  vscode 'redhat.vscode-xml'
  vscode 'redhat.vscode-yaml'
  vscode 'rust-lang.rust-analyzer'
  vscode 'sonarsource.sonarlint-vscode'
  vscode 'streetsidesoftware.avro'
  vscode 'tamasfe.even-better-toml'
  vscode 'tfsec.tfsec'
  vscode 'thamaraiselvam.remove-blank-lines'
  vscode 'timonwong.shellcheck'
  vscode 'tsandall.opa'
  vscode 'tylerharris.terraform-link-docs'
  vscode 'usernamehw.errorlens'
  vscode 'usernamehw.remove-empty-lines'
  vscode 'vadimcn.vscode-lldb'
  vscode 'vscjava.migrate-java-to-azure'
  vscode 'vscjava.vscode-gradle'
  vscode 'vscjava.vscode-java-debug'
  vscode 'vscjava.vscode-java-dependency'
  vscode 'vscjava.vscode-java-pack'
  vscode 'vscjava.vscode-java-test'
  vscode 'vscjava.vscode-java-upgrade'
  vscode 'vscjava.vscode-maven'
  vscode 'wix.vscode-import-cost'
  vscode 'yzhang.markdown-all-in-one'
  vscode 'zokugun.cron-tasks'
  vscode 'zokugun.sync-settings'
end
